# Task 1
# Ներմուծելa,b,c բնական թվերը, որոնք քառակուսային 
# հավասարման գործակիցներն են՝ ax**2+b*x+c=0: 
# Հաշվել հավասարման արմատները տրված գործակիցների համար՝
# 1) a=1,b=-6,c=8;
# 2) a=1,b=5,c=6; 
# 3) a=2,b=0,c=-9:
# Hint: (-b+-(b**2-4ac)**0.5)/2a


# Task 2
# Տրված է ուղղանկյուն եռանկյան էջերը, а և b, 
# գտնել նրա ներքնաձիքը
# Hint: a**2+b**2=c**2

# Task 3
# Ներմուծել բնական թիվ՝ N, և ստանալ նրա 
# վերջին թվանշանը։


# Task 4
# Ներմուծել բնական թիվ՝ N, 
# և ստանալ նրա թվանշանների գումարը և արտադրյալը։
# Hint: արտադրյալը - a*b*c*...*n

# Task 5
# Տրված է մի հարթության մեջ գտնվող երկու կետերի 
# կոորդինատները՝ (x1,y1) և (x2,y2)։ 
# Ծրագրի ելքում ստանալ այդ կետերի միջև 
# հեռավորությունը։
# Hint: ((x1 - x2)**2 + (y1-y2)**2)**0.5

# Task 6
# Գրել ծրագիր, որը տրված տողային փոփոխականի
# և բնական n թվի համար,
# կհեռացնի տրված տողային
# փոփոխականի n-րդ սիմվոլը

# Task 7
# Գրել ծրագիր, որը տրված տողային փոփոխականից
# կստանա նոր տողային
# փոփոխական առաջին և վերջին սիմվոլները տեղերով
# փոխելով։

# Task 8
# Գրել ծրագիր, որը տրված float թվի համար(10-ից փոքր),
# կստանա նրա նրա կրճատ ձևը ստորակետից հետո 
# 2 թվի ճշտությամբ։

# Task 9
# Մուտքագրել 3 թիվ, a,b,c: 
# Օգտագործելով պայմանի ստուգման և որոշման
# հրամանները, տպել այդ երեք թվից ամենամեծը։ 
# Նույն անել ամենափոքրը տպելու համար ևս։

# Task 10
# Մուքագրել որևէ բնական թիվ՝ N: 
# Պարզել այն կենտ է թե զույգ, և տպել պատասխանը։

 # Task 11
 # Տրված է ցանկացած բնական թիվ՝ N: 
 # Ստուգել արդյոք նա բաժանվում է միաժամանակ 
 # 5-ի և 7-ի:

# Task 12 
# Գրել ծրագիր, որը տրված տողային փոփոխականի համար 
# կստանա նոր տողային արժեք կազմված առաջինի միայն 
# երեքին պատիկ ինդեքսով էլեմենտներից։

# should send in working class before 13

# Task 13
# Գրել ծրագիր, որը տրված n բնական թվի համար,
# կտպի նրա բոլոր բաժանարարները։


# Task 14
# Գրել ծրագիր, որը տրված n և m բնական  թվերի համար,
# կտպի n * m ուղղանկյունները բաղկացած ‘*’ 
# սիմվոլներից։
# Օրինակ՝ n = 4, m = 9
# * * * * * * * * *
# * * * * * * * * *
# * * * * * * * * *
# * * * * * * * * *

# Task 15
# Գրել ֆունկցիա, որը տրված բնական թվի
# համար կվերադարձնի արդյոք այն պարզ է, թե ոչ։

# Task 16
# Գրել ֆունկցիա, որը տրված բնական թվի համար
# կվերադարձնի նրա ֆակտորիալը։

# Task 17
# Գրել ֆունկցիա, որը տրված 2 բնական թվերի համար
# կվերադարձնի նրանց ամենամեծ ընդհանուր բաժանարարը։

# Task 18
# Գրել ֆունկցիա, որը տրված բնական թվի համար 
# կվերադարձնի նրա աստիճանը։
# Հ․Գ Թվի աստիճան է կոչվում այն քայլերի քանակը,
# որը անհրաժեշտ է թիվը իր թվանշանների գումարոց
# փոխարինել այնքան, քանի դեռ այն չի դառնում միանիշ։
# Օրինակ՝
# N = 159
# Քայլ 1 -> n = 1 + 5 + 9 = 14
# Քայլ 2 -> n = 1+ 4 = 5
# Հետևաբար 159֊ի աստիճանը 2֊ն է։
